refac: graphviz -> mermaid
